app/views/ponds/show.html.erb

<ol>
	<% @pond.frogs.each do |frog| %>
---
SELECT "frogs".* FROM "frogs" WHERE "frogs"."pond_id" = ?  [["pond_id", 1]]

		<ol>
				<% frog.tadpoles.each do |tadpole| %>
---
SELECT "tadpoles".* FROM "tadpoles" WHERE "tadpoles"."frog_id" = ?  [["frog_id", 1]]