app/views/frogs/new.html.erb

  Water Type: <%= f.text_field :color %>
  Lives in Pond: <%= collection_select(:frog, :pond_id, Pond.all, :id, :name) %>
---
SELECT "ponds".* FROM "ponds"