app/views/frogs/show.html.erb

<ol>
	<% unless @frog.tadpoles.empty? %>
---
SELECT "tadpoles".* FROM "tadpoles" WHERE "tadpoles"."frog_id" = ?  [["frog_id", 1]]
SELECT 1 AS one FROM "tadpoles" WHERE "tadpoles"."frog_id" = ? LIMIT 1  [["frog_id", 1]]