app/controllers/frogs_controller.rb

  def index
  	@frogs = Frog.all
---
SELECT "frogs".* FROM "frogs"

  def new
  	@ponds = Pond.all
---
SELECT "ponds".* FROM "ponds"

  def create
  	@frog = Frog.new(frog_params)
  	#replaced with id logic below
  	if @frog.save
---
INSERT INTO "frogs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 05 Nov 2013 12:40:45 UTC +00:00], ["updated_at", Tue, 05 Nov 2013 12:40:45 UTC +00:00]]

  def edit
	  #@frog = Frog.find(params[:id]) =>replaced by code below
    @ponds = Pond.all
---
SELECT "ponds".* FROM "ponds"