app/controllers/ponds_controller.rb

SELECT "ponds".* FROM "ponds"
---
  def index
  	@ponds = Pond.all

INSERT INTO "ponds" ("created_at", "name", "updated_at", "water_type") VALUES (?, ?, ?, ?)  [["created_at", Tue, 05 Nov 2013 01:29:11 UTC +00:00], ["name", "Hello World Pond"], ["updated_at", Tue, 05 Nov 2013 01:29:11 UTC +00:00], ["water_type", "murky"]]
---
  def create
  	@pond = Pond.new(pond_params)
  	# @pond.name = params[:name]
  	# @pond.water_type = params[:water_type]
  	if @pond.save

UPDATE "ponds" SET "name" = ?, "water_type" = ?, "updated_at" = ? WHERE "ponds"."id" = 6  [["name", "Riverbed"], ["water_type", "Muddy"], ["updated_at", Tue, 05 Nov 2013 07:28:07 UTC +00:00]]
---
  def update
  	if @pond.update(pond_params)

SELECT "ponds".* FROM "ponds" WHERE "ponds"."id" = ? LIMIT 1  [["id", "17"]]
DELETE FROM "ponds" WHERE "ponds"."id" = ?  [["id", 17]]
---
  def destroy
    #delete all frogs & tadpoles at this pond id?
  	@pond = Pond.find(params[:id])
    @pond.destroy