app/controllers/tadpoles_controller.rb

	def index
	  @tadpoles = Tadpole.all
---
SELECT "tadpoles".* FROM "tadpoles"

 	def destroy
 		@tadpole = Tadpole.find(params[:id])
 		@tadpole.destroy
---
SELECT "tadpoles".* FROM "tadpoles" WHERE "tadpoles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tadpoles" WHERE "tadpoles"."id" = ?  [["id", 1]]

 	def evolve
    @tadpole = Tadpole.find(params[:id])
    @frog = Frog.new
    @frog.name = @tadpole.name
    @frog.color = @tadpole.color
    @frog.pond = @tadpole.frog.pond
    if @frog.save && @tadpole.destroy
---
SELECT "tadpoles".* FROM "tadpoles" WHERE "tadpoles"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "tadpoles" WHERE "tadpoles"."id" = ?  [["id", 7]]
INSERT INTO "frogs" ("color", "created_at", "name", "pond_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["color", "Brown"], ["created_at", Tue, 05 Nov 2013 13:10:12 UTC +00:00], ["name", "Jessica"], ["pond_id", 3], ["updated_at", Tue, 05 Nov 2013 13:10:12 UTC +00:00]]